# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"

    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-symbols-only-nerd-font"
    cask "font-recursive-code"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bat" # better cat
brew "nvm" # node version manager
brew "cloc" # lines of code counter
brew "tldr" #  Information about commands
brew "exa" # ls alternative
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "zsh" # zsh (latest)
brew "hyperfine" # benchmarking tool

# brew "rbenv" # ruby version manager

# brew 'sqlite' # sqlite3

# zsh
brew "spaceship" # zsh prompt
brew "zsh-autosuggestions" # zsh autosuggestions