# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "tldr" #  Information about commands
brew "exa" # ls alternative
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "zsh" # zsh (latest)

# zsh
brew "spaceship"
brew "zsh-autosuggestions"